CSI API ETABS v1
cDCoAS_3600_2018 Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDCoAS_3600_2018
Public Interface cDCoAS_3600_2018
Dim instance As cDCoAS_3600_2018
public interface class cDCoAS_3600_2018
type cDCoAS_3600_2018 =  interface end
The cDCoAS_3600_2018 type exposes the following members.
Methods
Name | Description
GetOverwrite
 Retrieves the value of a concrete design overwrite item.
GetPreference
 Retrieves the value of a concrete design preference item.
SetOverwrite
 Sets the value of a concrete design overwrite item.
SetPreference
 Sets the value of a concrete design preference item.
Top
See Also
Reference
ETABSv1 Namespace